Revit 2027 API
ExporterIFCUtils.GetLegacyCurtainSubElements Method
 Gets the sub elements from a legacy curtain element.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<ElementId> GetLegacyCurtainSubElements(
	Element element
)
Public Shared Function GetLegacyCurtainSubElements (
	element As Element
) As ICollection(Of ElementId)
public:
static ICollection<ElementId^>^ GetLegacyCurtainSubElements(
	Element^ element
)
static member GetLegacyCurtainSubElements :
        element : Element -> ICollection<ElementId>
Parameters
element Element
 The legacy curtain element.
Return Value
ICollection<ElementId>
 The element array.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace